Tests/Langley/Beta1p1-fine/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          20;
        startFace       40336;
    }
    outlet
    {
        type            patch;
        nFaces          384;
        startFace       40356;
    }
    axes
    {
        type            patch;
        nFaces          0;
        startFace       40740;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          4;
        startFace       40740;
    }
    wedge1
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          20320;
        startFace       40744;
    }
    wedge2
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          20320;
        startFace       61064;
    }
)

// ************************************************************************* //
